;)<? exit ?> блокируем запуск этого файла.
Описание действий и загружаемых файлов в этом разделе меню.
;==============================================================

;==============================================================
;указываем какой пункт меню подсвечиваем, когда выполняется одна из операций этого раздела.
menu_signed			=	"auto_bot_log"
;==============================================================


[actions]
;==============================================================
auto_bot_log	=	_admin/auto_bot_log/auto_bot_log.php
;==============================================================
