;)<? exit ?> блокируем запуск этого файла.
Описание действий и загружаемых файлов в этом разделе меню.
;==============================================================

;==============================================================
;указываем какой пункт меню подсвечиваем, когда выполняется одна из операций этого раздела.
menu_signed			=	"links_settings"
;==============================================================


[actions]
;==============================================================
links_settings		=	_admin/links_settings/links_settings.php
;==============================================================
