;)<? exit ?> блокируем запуск этого файла.
Описание действий и загружаемых файлов в этом разделе меню.
;==============================================================

;==============================================================
;указываем какой пункт меню подсвечиваем, когда выполняется одна из операций этого раздела.
menu_signed			=	"links_find_retry"
;==============================================================


[actions]
;==============================================================
links_find_retry		=	_admin/links_find_retry/links_find_retry.php
;==============================================================
