;)<? exit ?> блокируем запуск этого файла.
Описание действий и загружаемых файлов в этом разделе меню.
;==============================================================

;==============================================================
;указываем какой пункт меню подсвечиваем, когда выполняется одна из операций этого раздела.
menu_signed			=	"my_links"
;==============================================================


[actions]
;==============================================================
my_links		=	_admin/my_links/my_links.php
add_my_links		=	_admin/my_links/add_my_links.php
edit_my_links		=	_admin/my_links/edit_my_links.php
;==============================================================
