;)<? exit ?> блокируем запуск этого файла.
Описание действий и загружаемых файлов в этом разделе меню.
;==============================================================

;==============================================================
;указываем какой пункт меню подсвечиваем, когда выполняется одна из операций этого раздела.
menu_signed			=	"auto_bot_settings"
;==============================================================


[actions]
;==============================================================
auto_bot_settings	=	_admin/auto_bot_settings/auto_bot_settings.php
;==============================================================
