;)<? exit ?> блокируем запуск этого файла.
Описание действий и загружаемых файлов в этом разделе меню.
;==============================================================

;==============================================================
;указываем какой пункт меню подсвечиваем, когда выполняется одна из операций этого раздела.
menu_signed			=	"exit"
;==============================================================


[actions]
;==============================================================
exit		=	_admin/exit/exit.php
;==============================================================
