;)<? exit ?> блокируем запуск этого файла.
Описание действий и загружаемых файлов в этом разделе меню.
;==============================================================

;==============================================================
;указываем какой пункт меню подсвечиваем, когда выполняется одна из операций этого раздела.
menu_signed			=	"links_meta"
;==============================================================


[actions]
;==============================================================
links_meta		=	_admin/links_meta/links_meta.php
;==============================================================
