;)<? exit ?> блокируем запуск этого файла.
Описание действий и загружаемых файлов в этом разделе меню.
;==============================================================

;==============================================================
;указываем какой пункт меню подсвечиваем, когда выполняется одна из операций этого раздела.
menu_signed			=	"links_cat"
;==============================================================


[actions]
;==============================================================
links_cat		=	_admin/links_cat/links_cat.php
add_links_cat		=	_admin/links_cat/add_links_cat.php
edit_links_cat		=	_admin/links_cat/edit_links_cat.php
;==============================================================
