<?
if (Init_FairLinks!='Ok') die ('Not init!');		//если скрипт был запущен отдельно от системы, то останавливаемся с сообщением об ошибке.

//###############################################################
//#		Функции для работы с шаблонами.			#
//###############################################################

//========================================

function clear_garbage_tpl ($tpl)
{
//функция вырезает мусор 
$tpl = preg_replace('/<!--.*?-->/s', '',$tpl);	//выреазаем комметарии типа <!-- comment -->
return $tpl;
}
//========================================

function si_field_replace ($data_db, $tpl)
{
//функция заменяет в $str метки типа {field} на значения полей в $data_db['field']
//Функци может передаваться доп. параметр.
//если доп. параметр ==1, то производим очистку от мусора (комментариев и пр.) в шаблоне.
$adv=0;
if (!is_array($data_db)) return $tpl;
if (func_num_args()==3) $adv=func_get_arg (2);

if ($adv==1) $tpl=clear_garbage_tpl ($tpl);	//чистим от мусора шаблон.

$key_array=array_keys ($data_db);
for($i=0; $i<count ($key_array); $i++) $tpl=str_replace ('{'.$key_array[$i].'}', $data_db[$key_array[$i]], $tpl);
return $tpl;
}

//==============================================

function si_ff_replace ($data_db, $file_name)
{
//функция загружает шаблон из файла.
//аналог si_field_replace, только шаблон грузится из файла, а не передаётся строкой.
//Функци может передаваться доп. параметр.
//если доп. параметр ==1, то производим очистку от мусора (комментариев и пр.) в шаблоне.

$adv=0;
if (func_num_args()==3) $adv=func_get_arg (2);

$tpl=file_get_contents ($file_name);
return si_field_replace ($data_db, $tpl, $adv);
}
//==============================================


?>