;)<? exit ?> блокируем запуск этого файла.
Описание действий и загружаемых файлов в этом разделе меню.
;==============================================================

;==============================================================
;указываем какой пункт меню подсвечиваем, когда выполняется одна из операций этого раздела.
menu_signed			=	"links_item"
;==============================================================


[actions]
;==============================================================
links_item		=	_admin/links_item/links_item.php
add_links_item		=	_admin/links_item/add_links_item.php
edit_links_item		=	_admin/links_item/edit_links_item.php
;==============================================================
