;)<? exit ?> блокируем запуск этого файла.
Описание действий и загружаемых файлов в этом разделе меню.
;==============================================================

;==============================================================
;указываем какой пункт меню подсвечиваем, когда выполняется одна из операций этого раздела.
menu_signed			=	"main_page"
;==============================================================


[actions]
;==============================================================
main_page		=	_admin/main_page/main_page.php
;==============================================================
